# IsValidNonContinuousRailMaterial Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailInfo..::..IsValidNonContinuousRailMaterial Method
NonContinuousRailInfo Class See Also
---
Checks whether an ElementId is a valid material Id of a non-continuous rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsValidNonContinuousRailMaterial(
	ElementId materialId
)
```

Visual Basic
---
```text
Public Function IsValidNonContinuousRailMaterial ( _
	materialId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidNonContinuousRailMaterial(
	ElementId^ materialId
)
```

# ### Parameters
materialId
    Type: Autodesk.Revit.DB..::..ElementId The material Id to be checked.
# ### Return Value
True if the ElementId refers to a valid material or it is invalidElementId, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace